Operator js

1)оператор присваенвание (=)
2)операторы сравнение (== Возвращает true, если операнды равны. === строга равно  Возвращает true, если операнды не равны!=  не равно Возвращает true, если операнды не равны !== строго не равно Возвращает true, если операнды не равны и/или имеют разный тип. < <= > >=)
@@@@@Примечание: (=>) не оператор, а нотация Стрелочных функций.
3)Арифметические операторы( + - / % * ** степен (exposant au carre apr exemple) )это тоже бинарные 
4)Унарные операторы(delete in void  instanceof typeof  ++ add 1 -- minuc 1 -add minuc + conert string to number )
5)Логические операторы(|| or  && and  ! no )
6)Битовые (поразрядные) операторы(| & ^ ~ << >> >>>)
7)Строковые операторы(+ += exemple console.log("my " + "string"); // в консоли выведется строка  "my string".
var mystring = "alpha";
mystring += "bet"; // получается значение "alphabet" и присваивается mystring.)
8)Условный (тернарный) оператор(является единственным оператором JavaScript, который использует три операнда.condition ? val1 : val2 
  exemple  var status = age >= 18 ? "adult" : "minor"; Если condition (условие) - истина, то оператор принимает значение val1. В противном случае оператор принимает значение val2)
9)Оператор запятая (,)
10)Операторы отношения(in)


Выражения Выражением является любой корректный блок кода, который возвращает значение.
this 